# 연습문제 1

In [3]:
import pandas as pd, numpy as np
a = pd.DataFrame(np.arange(16).reshape(4,4),
                index = list('abcd'),
                columns = list('abcd'.upper()))
a

    A   B   C   D
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

# DataFrame과 조건검색

In [4]:
a[a.B > 4]

    A   B   C   D
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

In [5]:
a[ (a.B) > 5 & (a.C > 6)]

    A   B   C   D
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

In [6]:
a.loc[a.B > 4, 'B':'C']

    B   C
b   5   6
c   9  10
d  13  14

# Data Frame과 Series

In [7]:
a.B

a     1
b     5
c     9
d    13
Name: B, dtype: int32

In [8]:
a['B']

a     1
b     5
c     9
d    13
Name: B, dtype: int32

In [9]:
a.loc['a']

A    0
B    1
C    2
D    3
Name: a, dtype: int32

In [10]:
a.iloc[0]

A    0
B    1
C    2
D    3
Name: a, dtype: int32

In [11]:
a.B = pd.Series(np.arange(4)) # 적용 안됨
a

    A   B   C   D
a   0 NaN   2   3
b   4 NaN   6   7
c   8 NaN  10  11
d  12 NaN  14  15

In [12]:
a.loc['a'] = pd.Series(np.arange(4)) # 적용 안됨
a

      A   B     C     D
a   NaN NaN   NaN   NaN
b   4.0 NaN   6.0   7.0
c   8.0 NaN  10.0  11.0
d  12.0 NaN  14.0  15.0

In [13]:
a.B = pd.Series(np.arange(4),
               index=list('abcd'))
a

      A  B     C     D
a   NaN  0   NaN   NaN
b   4.0  1   6.0   7.0
c   8.0  2  10.0  11.0
d  12.0  3  14.0  15.0

In [14]:
a.loc['a'] = pd.Series(np.arange(4),
                      index=list('ABCD'))
a

      A  B     C     D
a   0.0  1   2.0   3.0
b   4.0  1   6.0   7.0
c   8.0  2  10.0  11.0
d  12.0  3  14.0  15.0

# DataFrame과 ndarray

In [15]:
a

      A  B     C     D
a   0.0  1   2.0   3.0
b   4.0  1   6.0   7.0
c   8.0  2  10.0  11.0
d  12.0  3  14.0  15.0

In [16]:
a.B = 100
a

      A    B     C     D
a   0.0  100   2.0   3.0
b   4.0  100   6.0   7.0
c   8.0  100  10.0  11.0
d  12.0  100  14.0  15.0

In [18]:
a.C = np.arange(4)
a

      A    B  C     D
a   0.0  100  0   3.0
b   4.0  100  1   7.0
c   8.0  100  2  11.0
d  12.0  100  3  15.0

In [19]:
a.loc[:,'C':'D'] = np.arange(8).reshape(4,2)
a

      A    B  C  D
a   0.0  100  0  1
b   4.0  100  2  3
c   8.0  100  4  5
d  12.0  100  6  7

In [20]:
a[1:2]

     A    B  C  D
b  4.0  100  2  3

In [21]:
a[1:2].shape

(1, 4)

In [22]:
a[1:2] = 100
a

       A    B    C    D
a    0.0  100    0    1
b  100.0  100  100  100
c    8.0  100    4    5
d   12.0  100    6    7

In [23]:
a[1:2] = np.arange(4).reshape(1,4)
a

      A    B  C  D
a   0.0  100  0  1
b   0.0    1  2  3
c   8.0  100  4  5
d  12.0  100  6  7

In [24]:
a[1:2] = np.arange(1,5)
a

      A    B  C  D
a   0.0  100  0  1
b   1.0    2  3  4
c   8.0  100  4  5
d  12.0  100  6  7

In [25]:
a[1:3] = np.arange(8).reshape(2,4)
a

      A    B  C  D
a   0.0  100  0  1
b   0.0    1  2  3
c   4.0    5  6  7
d  12.0  100  6  7

# DataFrame과 DataFrame

In [28]:
pd.DataFrame(np.arange(4))

   0
0  0
1  1
2  2
3  3

In [29]:
a[0:1]

     A    B  C  D
a  0.0  100  0  1

In [30]:
a[0:1] = pd.DataFrame(np.arange(4).reshape(1,4))
a

      A    B  C  D
a   0.0    1  2  3
b   0.0    1  2  3
c   4.0    5  6  7
d  12.0  100  6  7

In [31]:
a[0:2]

     A  B  C  D
a  0.0  1  2  3
b  0.0  1  2  3

In [32]:
a[0:2] = pd.DataFrame(np.arange(8).reshape(2,4),
                     index = ['b','a'])
a

      A    B  C  D
a   0.0    1  2  3
b   4.0    5  6  7
c   4.0    5  6  7
d  12.0  100  6  7

In [33]:
a.iloc[0:2,0:2]

     A  B
a  0.0  1
b  4.0  5

In [35]:
a.iloc[0:2,0:2] = pd.DataFrame(np.arange(4).reshape(2,2),
                              index = ['b','a'])
a

      A    B  C  D
a   0.0    1  2  3
b   2.0    3  6  7
c   4.0    5  6  7
d  12.0  100  6  7

In [36]:
a.iloc[0:2,0:2] = pd.DataFrame(np.arange(4).reshape(2,2),
                              index = ['b','a'],
                              columns = ['B','A']) 
a #컬럼을 준다 해도 순차적으로 채워짐

      A    B  C  D
a   0.0    1  2  3
b   2.0    3  6  7
c   4.0    5  6  7
d  12.0  100  6  7

# concat

In [37]:
pd.concat([a.iloc[0:1,0:3], a.iloc[0:2,1:]])

     A  B  C    D
a  0.0  1  2  NaN
a  NaN  1  2  3.0
b  NaN  3  6  7.0

In [38]:
pd.concat([a.iloc[0:1,0:3], a.iloc[0:2,1:]], axis=1)

     A    B    C  B  C  D
a  0.0  1.0  2.0  1  2  3
b  NaN  NaN  NaN  3  6  7

# 연습문제 2

In [39]:
import os, re
import pandas as pd
from collections import Counter
TDM = pd.concat(
    [pd.DataFrame(pd.Series(
        Counter(re.sub('^\W+|\W+$','',j)
               for j in open('./01_data/'+i).read().lower().split())),
                 columns=[i])
    for i in os.listdir('./01_data') if i.endswith('.txt')],
    axis=1)
TDM = TDM.reindex(sorted(TDM.index)).fillna(0).astype('int')

In [40]:
TDM

       01.txt  02.txt  03.txt  04.txt
14th        0       0       0       1
15          0       0       0       1
1656        0       0       0       1
1761        0       0       0       1
17th        0       0       0       1
...       ...     ...     ...     ...
years       2       0       0       0
york        0       0       1       0
you         4       0       0       0
young       0       1       0       0
your        5       0       0       0

[244 rows x 4 columns]

In [41]:
TDM.to_csv('TDM.txt',sep='\t')